DataProcessors/ЗагрузкаПравоустанавливающихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаПравоустанавливающихДокументов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/лб_ОтветственныеЗаЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>лб_ОтветственныеЗаЛицевыеСчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/бит_ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемПрефикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВестиРасчетПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛицевогоСчетаГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипЛицевогоСчетаГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Льготный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_ПравоустанавливающиеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ПравоустанавливающиеДокументы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияВыдавшаяДокумент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыДокументовНаЖилье</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>лб_Архив</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>лб_ИспользоватьАрхивДляФЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>лб_НомерЛС10</Name>
					<Comment>для переноса данных</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Проживающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ДатаВнесенияДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗагрузкаПравоустанавливающихДокументов/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура КаталогПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КаталогПриИзменении(Элемент)
	КаталогПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Режим = РежимДиалогаВыбораФайла.;
	//ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	//Если ДиалогОткрытияФайла.Выбрать() Тогда
	//	объект.Каталог = СокрЛП(ДиалогОткрытияФайла.Каталог);
	//КонецЕсли;	
	
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогФыбораФайла.Фильтр = "Файл (*.dbf)|*.dbf"; 
	ДиалогФыбораФайла.Заголовок = "Выберите файл";
	//ДиалогФыбораФайла.ПредварительныйПросмотр = Истина;
	ДиалогФыбораФайла.ИндексФильтра = 0;
	Если ДиалогФыбораФайла.Выбрать() Тогда
		объект.Файл = ДиалогФыбораФайла.ПолноеИмяФайла;
		объект.Каталог = СокрЛП(ДиалогФыбораФайла.Каталог);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция НайтиДанныеПоКв(Здание, НомерКвартиры)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Попытка 
		//НомерКвартиры = Число(НомерКвартиры);
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_Квартиры.Ссылка КАК Квартира,
		|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
		|	лб_ОтветственныеЗаЛицевыеСчета.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.лб_ОтветственныеЗаЛицевыеСчета КАК лб_ОтветственныеЗаЛицевыеСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Квартиры КАК бит_Квартиры
		|			ПО бит_ЛицевыеСчета.Квартира = бит_Квартиры.Ссылка
		|		ПО лб_ОтветственныеЗаЛицевыеСчета.ЛицевойСчет = бит_ЛицевыеСчета.Ссылка
		|ГДЕ
		|	бит_Квартиры.НомерКвартиры = &НомерКвартиры
		|	И бит_Квартиры.Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец", Здание);
		Запрос.УстановитьПараметр("НомерКвартиры", Число(НомерКвартиры));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Исключение
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_Квартиры.Ссылка КАК Квартира,
		|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
		|	лб_ОтветственныеЗаЛицевыеСчета.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.лб_ОтветственныеЗаЛицевыеСчета КАК лб_ОтветственныеЗаЛицевыеСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Квартиры КАК бит_Квартиры
		|			ПО бит_ЛицевыеСчета.Квартира = бит_Квартиры.Ссылка
		|		ПО лб_ОтветственныеЗаЛицевыеСчета.ЛицевойСчет = бит_ЛицевыеСчета.Ссылка
		|ГДЕ
		|	бит_Квартиры.Наименование = &НомерКвартиры
		|	И бит_Квартиры.Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец", Здание);
		Запрос.УстановитьПараметр("НомерКвартиры", НомерКвартиры);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	КонецПопытки;
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Квартира", ВыборкаДетальныеЗаписи.Квартира);
		СтруктураДанных.Вставить("ЛицевойСчет", ВыборкаДетальныеЗаписи.ЛицевойСчет);
		СтруктураДанных.Вставить("Ответственный", ВыборкаДетальныеЗаписи.Ответственный);
		Возврат СтруктураДанных;
	Иначе
		Сообщить("Квартира " + НомерКвартиры + " не найдена");
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Квартира", Справочники.бит_Квартиры.ПустаяСсылка());
		СтруктураДанных.Вставить("ЛицевойСчет", Справочники.бит_ЛицевыеСчета.ПустаяСсылка());
		СтруктураДанных.Вставить("Ответственный", Справочники.бит_Проживающие.ПустаяСсылка());
		Возврат СтруктураДанных;
	КонецЕсли;;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецФункции

&НаКлиенте
Процедура Загрузить(Команда)
	МассивДанных = Новый Массив;
	//ФайлыКапРем = НайтиФайлы(объект.Каталог,"*.dbf");
	//Для Каждого Файл Из ФайлыКапРем Цикл
	ПутьКНовомуФайлу = Объект.Каталог+"\" + "1234.dbf";
	КопироватьФайл(Объект.Файл, ПутьКНовомуФайлу);
	ПрочитатьФайл(ПутьКНовомуФайлу, МассивДанных);
	УдалитьФайлы(ПутьКНовомуФайлу);
	
	//КонецЦикла;
	ОбработатьДанные();
	//ЗагрузитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(Файл,МассивДанных)
	
	ФайлDBF = Новый XBase; // создаем новый объект
	ФайлDBF.Кодировка = КодировкаXBase.OEM;
	ФайлDBF.ОткрытьФайл(Файл); // открытие файла
	ФайлDBF.Первая(); // устанавливает курсор на первую запись
	
	// цикл обрабатывается до тех пор, пока не дошел до последней записи
	Пока НЕ ФайлDBF.ВКонце() Цикл

		Если НЕ (СокрЛП(ФайлDBF.UL) = "" И СокрЛП(ФайлDBF.NOM) = "" И  СокрЛП(ФайлDBF.N_KV) = "") Тогда
			Строка = Файлы.Добавить();
			МассивФайла = Новый Массив;
			Строка.ЛС = СокрЛП(ФайлDBF.LS);
			Строка.УЛ = СокрЛП(ФайлDBF.UL);
			Строка.НОМ = СокрЛП(ФайлDBF.NOM);
			Строка.НКВ = СокрЛП(ФайлDBF.N_KV);
			Строка.ДОКС = СокрЛП(ФайлDBF.DOCS);
			
			МассивФайла.Добавить(ФайлDBF.LS);
			МассивФайла.Добавить(ФайлDBF.UL);
			МассивФайла.Добавить(ФайлDBF.NOM);
			МассивФайла.Добавить(ФайлDBF.N_KV);
			МассивФайла.Добавить(ФайлDBF.DOCS);
			МассивДанных.Добавить(МассивФайла);
		Иначе
			Строка.ДОКС = Строка.ДОКС + " " + СокрЛП(ФайлDBF.LS);
		КонецЕсли;
		ФайлDBF.Следующая(); //передвигаем курсор далее
		
	КонецЦикла;
	
	//ФайлDBF.ЗакрытьФайл();
	//Тз = Файлы.Выгрузить();
	//Тз.Очистить();
	//Для Каждого СТр Из Файлы Цикл
	//	МассивПодстрок = РазложитьСтрокуВМассивПодстрок(Стр.Докс, ",");	
	//	Для Каждого Эл Из МассивПодстрок Цикл
	//		нстр = Тз.Добавить();
	//		нстр.ЛС = СТр.лс;
	//		нстр.УЛ = СТр.УЛ;
	//		нстр.НОМ = СТр.НОМ;
	//		нстр.НКВ = СТр.НКВ;
	//		нстр.ДОКС = Эл;
	//	КонецЦикла;
	//	
	//КонецЦикла;
	//Файлы.Очистить();
	//Файлы.Загрузить(ТЗ);
КонецПроцедуры

&НаСервере
Функция ОбработатьДанные()
	Тз = Документы.Выгрузить();
	Тз.Очистить();
	Для Каждого СТр Из Файлы Цикл
		МассивПодстрок = РазложитьСтрокуВМассивПодстрок(Стр.Докс, ",");	
		Для Каждого Эл Из МассивПодстрок Цикл
			Если НЕ СокрЛП(Эл) = "1" Тогда
				нстр = Тз.Добавить();
				ДанныеПоКв = НайтиДанныеПоКв(Дом, Стр.НКВ);
				нстр.ЛицевойСчет = ДанныеПоКв.ЛицевойСчет;
				нстр.Проживающий = ДанныеПоКв.Ответственный;
				нстр.Квартира = ДанныеПоКв.Квартира;
				нстр.Наименование = Эл;
				Нстр.Дата = ПроверитьДату(эл);
				Нстр.АрхивОмск = Стр.Докс;
				Если СокрЛП(ЭЛ) = "" Тогда
					Сообщить("Строка с ошибочным наименованием " + ДанныеПоКв.ЛицевойСчет +" "+ ДанныеПоКв.Ответственный +" "+ ДанныеПоКв.Квартира);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	Файлы.Очистить();
	Документы.Очистить();
	Документы.Загрузить(ТЗ);
	
КонецФункции	

&НаСервере
Функция ПроверитьДату(Строка)
	Дата = Дата("00010101");
	МассивСтрок = РазложитьСтрокуВМассивПодстрок(Строка, " ");
	Для Каждого Эл Из МассивСтрок Цикл 
		МассивСтрокЭл = РазложитьСтрокуВМассивПодстрок(Эл, ".");
		Если МассивСтрокЭл.Количество() = 3 Тогда
			Попытка 
				Дата = Дата(МассивСтрокЭл[2] + МассивСтрокЭл[1] + МассивСтрокЭл[0]);
			Исключение
				//Сообщить(Эл + "_" + Строка);
			КонецПопытки;
		КонецЕсли;
		//Попытка
		//	Дата = Дата(эл);
		//Исключение
		//	Продолжить;
		//КонецПопытки;
	КонецЦикла;
	Возврат Дата; 	
КонецФункции

&НаСервере
Функция РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ",",
	Знач ПропускатьПустыеСтроки = Неопределено)
	
	Результат = Новый Массив;
	
	// для обеспечения обратной совместимости
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Строка) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	//
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
		Результат.Добавить(Строка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СоздатьДокументыНаСервере()
	
	Для Каждого Строка Из Документы Цикл
		
		Документ = Справочники.бит_ПравоустанавливающиеДокументы.СоздатьЭлемент();
		Документ.бит_ЛицевойСчет = Строка.ЛицевойСчет;
		Документ.бит_ДатаВнесенияДокументов = ТекущаяДата();
		Документ.ДатаДокумента = Строка.Дата;
		Документ.бит_Проживающий = Строка.Проживающий;
		Документ.Наименование = Строка.Наименование;
		Документ.лб_Архив = Строка.АрхивОмск;
		Попытка
			Документ.Записать();
		Исключение
			Сообщить("Не создан документ с ошибочным наименованием " + Строка.АрхивОмск + Символы.ПС+ "Проживающий " + Строка.Проживающий + " кв." + Строка.Квартира);
		КонецПопытки;
	КонецЦикла;
	Сообщить("Загрузка завершена");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервере();
КонецПроцедуры
